НВ_Доработки/DataProcessors/СБПБанкГПБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СБПБанкГПБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>NotStarted - операции по QR-коду не существует, Received - операция в обработке, InProgress - операция в обработке, Accepted - операция завершена успешно, Rejected - операция отклонена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_content</Name>
					<Comment>содержимое изображения (для image/png - в кодировке base64)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>payload</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

НВ_Доработки/InformationRegisters/СБП_QRКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СБП_QRКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Comment>CREATED, BLOCKED, NOT_STARTED, ACCEPTED, REJECTED, RECEIVED</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amount</Name>
					<Comment>Сумма операции в копейках</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>payload</Name>
					<Comment>Payload зарегистрированного QR кода в СБП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>qrcType</Name>
					<Comment>Тип QR кода: 01 - Статический QR-код, 02 - Динамический QR-код (QR на кассе), 03 - QR-код для привязки счета Плательщика (подписки)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеНаРС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

НВ_Доработки/DataProcessors/СБПБанкГПБ/Forms/ФормаСозданияНового/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаписьРегистра = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
	//ЗаписьРегистра.Заказ = Параметры.Заказ;
	//ЗаписьРегистра.qrcId = Запись.qrcId;
	//ЗаписьРегистра.Прочитать();
	//Если ЗаписьРегистра.Выбран() Тогда //значит такой записи нет
	//  	ДД = Base64Значение(ЗаписьРегистра.imageParams_content.Получить());
	//	СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(ДД, Ложь), УникальныйИдентификатор);
	//КонецЕсли;
	Если Параметры.Свойство("Заказ") Тогда
		Объект.Заказ = Параметры.Заказ.Ссылка;
		Объект.Сумма = Параметры.Заказ.СуммаДокумента;
	Иначе
		Объект.Заказ = Документы.ЗаказПокупателя.НайтиПоНомеру("000039232", ТекущаяДата());
		Объект.Сумма = Объект.Заказ.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьQRКодНаСервере()
	//Обработка = РеквизитФормыВЗначение("Объект");
	//Данные = Обработка.ПолучитьQRКодПоЗаказу(Объект.Заказ);
	//Если Данные.Свойство("QRКод") Тогда
	//	Объект.Статус                = Данные.QRКод.Статус;
	//	Объект.ДатаГенерации         = Данные.QRКод.ДатаГенерации;
	//	Объект.imageParams_width     = Данные.QRКод.imageParams_width;
	//	Объект.imageParams_height    = Данные.QRКод.imageParams_height;
	//	Объект.imageParams_mediaType = Данные.QRКод.imageParams_mediaType;
	//	ДД = Base64Значение(Данные.QRКод.imageParams_content);
	//	СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(ДД, Ложь), УникальныйИдентификатор);
	//	Объект.imageParams_content   = Данные.QRКод.imageParams_content;
	//	Объект.payload               = Данные.QRКод.payload;
	//	Объект.qrcType               = Данные.QRКод.qrcType;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьQRКод(Команда)
	//ПолучитьQRКодНаСервере();
    Если ПараметрыДляСБПЗаполнены() Тогда
		СтруктураQRВзноса = РегистрацияInvoiceМетки(); 
		
		Если СтруктураQRВзноса.Результат Тогда
			content       = СтруктураQRВзноса.content;
			Объект.payload = СтруктураQRВзноса.payload;
			Объект.qrcId = СтруктураQRВзноса.QRCID;
			//Записать();
			
			//записать qr код в регистр сведений
			
			ДД = Base64Значение(content);
			Картинка = Новый Картинка(ДД, Ложь);
			СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
			//ПоместитьВОбъектНаСервере(content);
			ЗаписатьQRКодВРегистр(СтруктураQRВзноса);
			ЭтаФорма.ОбновитьОтображениеДанных();
		Иначе 
			Сообщить("Не удалось сгенерировать QR!");
		КонецЕсли;		
	Иначе 
		ПоказатьПредупреждение(, "Проверьте, заполнены ли все параметры");
	КонецЕсли;
	// для обновления Реквизитов
	//ЭтаФорма.Прочитать();
	//ОповеститьОбИзменении
	// Обновление данных
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры 

Функция ЗаписатьQRКодВРегистр(СтруктураQRВзноса)
	
	Если ЗначениеЗаполнено(СтруктураQRВзноса.qrcId) Тогда
		Попытка
			МенеджерЗаписи = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Заказ = Объект.Заказ;
			МенеджерЗаписи.qrcId = СтруктураQRВзноса.qrcId;
			МенеджерЗаписи.status = СтруктураQRВзноса.status;
			МенеджерЗаписи.ДатаГенерации = ТекущаяДата();
			//МенеджерЗаписи.imageParams_width = Ответ.Data.image.width;
			//МенеджерЗаписи.imageParams_height = Ответ.Data.image.height;
			МенеджерЗаписи.imageParams_mediaType = СтруктураQRВзноса.mediaType;
			Хранилище = Новый ХранилищеЗначения(СтруктураQRВзноса.content, Новый СжатиеДанных());
			МенеджерЗаписи.imageParams_content = Хранилище;
			МенеджерЗаписи.payload = СтруктураQRВзноса.payload;
			МенеджерЗаписи.qrcType = "02";
			МенеджерЗаписи.amount = Объект.Сумма;
			МенеджерЗаписи.Записать();
		Исключение
			Текст = "Ошибка выгрузки записи регистра сведений СБП_QRКоды: " + ОписаниеОшибки() + "";
			//Сообщить(Текст, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
		КонецПопытки;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПараметрыДляСБПЗаполнены() 
	ОсновнаяОрганизацияДляСБП = Константы.НВД_ОсновнаяОрганизацияДляСБП.Получить();
	ОсновнойБанковскийСчетДляСБП = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	Если ЗначениеЗаполнено(ОсновнаяОрганизацияДляСБП) И ЗначениеЗаполнено(ОсновнойБанковскийСчетДляСБП) И 
		ЗначениеЗаполнено(Константы.НВД_legalId.Получить()) И ЗначениеЗаполнено(Константы.НВД_merchantId.Получить()) И 
		ЗначениеЗаполнено(Константы.НВД_АдресСервисаСБП.Получить()) И ЗначениеЗаполнено(Константы.НВД_ПарольСБП.Получить()) И
		ЗначениеЗаполнено(Константы.НВД_ПортСервисаСБП.Получить()) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Функция РегистрацияInvoiceМетки()  
	
	Результат = Новый Структура("Результат, ПричинаОтказа, payload, QRCID, mediaType, content, message, transactionId, code, status", Ложь, "", "", "", "", "");
	
	ИмячЭтапа = "Регистрация Invoice Метки";
	
	//сформриуем JSON строку запроса
	СтруктураInvoiceМетки = ПолучитьJSONРегистрацииInvoiceМетки();
	
	Если СтруктураInvoiceМетки.Результат Тогда
		СтрокаТелаЗапроса = СтруктураInvoiceМетки.СтрокаQRМетки;
		
		Заголовки = Новый Соответствие;
		//Заголовки.Вставить("Host","195.225.38.125");
		Заголовки.Вставить("Content-Type", "application/json");
		//Заголовки.Вставить("Content-Type", "text/plain");
		//--data-raw '
		
		ПараметрыСоединения = ПолучитьПараметрыПодключенияСБП();
		
		HTTP_Запрос = Новый HTTPЗапрос("/merchant/v1/qrc-data", Заголовки);
		HTTP_Запрос.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);  
		
		НТТР_Соединение = Новый HTTPСоединение(ПараметрыСоединения.АдресСервиса //сервер
		, ПараметрыСоединения.ПортСервиса //порт
		, ПараметрыСоединения.Логин//пользователь "LA0000047585"
		, ПараметрыСоединения.Пароль//пароль     "Km27b8fkeTuuBo"
		, //прокси
		, //таймаут
		//, ПараметрыСоединения.ЗащитаСоединения //параметры защиты соединения... короче где SSL сертификат барть
		,Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено)
		, //испольовать аутентификацию ОС
		);
		//-- 
		
		Попытка
			HTTP_Ответ = НТТР_Соединение.ОтправитьДляОбработки(HTTP_Запрос); //это POST запрос  
		Исключение
		    Сообщить(ОписаниеОшибки());
			Возврат Результат;  
		КонецПопытки; 
		
		ТекстОтветаHTTP = HTTP_Ответ.ПолучитьТелоКакСтроку(); 
		
		//Сообщить(ТекстОтветаHTTP);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтветаHTTP);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Для Каждого Стр из ДанныеJSON Цикл
			Если Стр.Ключ = "message" Тогда 
				message = Стр.Значение;	
			КонецЕсли;
			Если Стр.Ключ = "transactionId" Тогда 
				transactionId = Стр.Значение;	
			КонецЕсли;
			Если Стр.Ключ = "code" Тогда 
				code = Стр.Значение;	
			КонецЕсли;
			Если Стр.Ключ = "data" Тогда 	
				Для Каждого СтрДата Из Стр.Значение Цикл 
					Если СтрДата.Ключ = "status" Тогда 
						status = СтрДата.Значение;	
					КонецЕсли;
					Если СтрДата.Ключ = "payload" Тогда 
						СсылкаQR = СтрДата.Значение;	
					КонецЕсли;
					Если СтрДата.Ключ = "qrcId" Тогда 
						QRCID = СтрДата.Значение;	
					КонецЕсли;
					Если СтрДата.Ключ = "image" Тогда
						Для Каждого СтрImg Из СтрДата.Значение Цикл
							Если СтрImg.Ключ = "mediaType" Тогда 
								mediaType = СтрImg.Значение;	
							КонецЕсли;
							Если СтрImg.Ключ = "content" Тогда 
								content = СтрImg.Значение;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Результат.Результат		= Истина; 
		Результат.code	        = code;
		Результат.ПричинаОтказа	= message;
		Результат.transactionId	= transactionId;
		Если Результат.code = "000" Тогда
			Результат.payload	    = СсылкаQR; 
			Результат.QRCID	        = QRCID;
			Результат.message	    = message;	
			Результат.status	    = status;
			Результат.mediaType	    = mediaType; 
			Результат.content	    = content;
		КонецЕсли;	
	Иначе
		Результат = СтруктураInvoiceМетки; //полностью копируем результаты регистрации метки
	КонецЕсли;  
	
	Возврат Результат;  
	
КонецФункции // РегистрацияInvoiceМетки()

&НаКлиенте
Функция ПолучитьJSONРегистрацииInvoiceМетки() Экспорт   
	
	Результат = Новый Структура("Результат, ПричинаОтказа, СтрокаQRМетки", Ложь, "", "");
	
	ПараметрыЗаписи_JSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	Запись_JSON = Новый ЗаписьJSON;
	Запись_JSON.УстановитьСтроку(ПараметрыЗаписи_JSON);
	
	СтруктураПараметровСчетаДляСПБ = ПолучитьСтруктуруПараметровСчетаДляСПБ();
	
	СтруктураКода = Новый Структура();
	СтруктураКода.Вставить("legalId"						, СтруктураПараметровСчетаДляСПБ.legalId);
	СтруктураКода.Вставить("account"						, СтруктураПараметровСчетаДляСПБ.account);
	СтруктураКода.Вставить("merchantId"						, СтруктураПараметровСчетаДляСПБ.merchantId);
	СтруктураКода.Вставить("templateVersion"				, "01");
	СтруктураКода.Вставить("qrcType"						, "02");
	СтруктураКода.Вставить("amount"							, Объект.Сумма*100);
	СтруктураКода.Вставить("currency"						, "RUB");
	СтруктураКода.Вставить("paymentPurpose"					, НазначениеПлатежаНаСервере(Объект.Заказ));
	//СтруктураКода.Вставить("paymentDetails"					, СтруктураДеталиПолупки);
	СтруктураКода.Вставить("callbackMerchantNotifications"	, СтруктураПараметровСчетаДляСПБ.callbackMerchantNotifications);         //     свой url http://1c.optceiling.ru/test/hs/gpb 
	СтруктураКода.Вставить("mediaType"						, "image/png");
	СтруктураКода.Вставить("width"						    , "300");
	СтруктураКода.Вставить("height"						    , "300");
	
	ЗаписатьJSON(Запись_JSON, СтруктураКода);
	
	//Запись_JSON.ЗаписатьКонецОбъекта();
	Строка_JSON	= Запись_JSON.Закрыть();
	
	Результат.Результат		= Истина;
	Результат.ПричинаОтказа	= "";
	Результат.СтрокаQRМетки	= Строка_JSON;
	
	Возврат Результат; 
	
КонецФункции // ПолучитьJSONФормированияQRКода()

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметровСчетаДляСПБ()
	СтруктураПараметров = Новый Структура("legalId, merchantId, account, callbackMerchantNotifications");
	
	БанковскийСчет = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		СтруктураПараметров.legalId = Константы.НВД_legalId.Получить();
		СтруктураПараметров.merchantId = Константы.НВД_merchantId.Получить();
		СтруктураПараметров.account = БанковскийСчет.НомерСчета;
		СтруктураПараметров.callbackMerchantNotifications = Константы.НВД_callbackMerchantNotifications.Получить();
	КонецЕсли;	
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПодключенияСБП() 
	
	Результат = Новый Структура;
	//Результат.Вставить("ЗащитаСоединения"	, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	Результат.Вставить("АдресСервиса"		, Константы.НВД_АдресСервисаСБП.Получить());
	Результат.Вставить("ПортСервиса"		, Константы.НВД_ПортСервисаСБП.Получить());
	Результат.Вставить("Логин"      		, Константы.НВД_legalId.Получить());
	Результат.Вставить("Пароль"		        , Константы.НВД_ПарольСБП.Получить());
	//Результат.Вставить("АдресСервиса"		, "testapi.sbp.gazprombank.ru");
	//Результат.Вставить("ПортСервиса"		, 9443);
	
	Возврат Результат; 
	
КонецФункции // ПолучитьЗащищенноеСоединениеСБП() 

&НаСервереБезКонтекста
Функция НазначениеПлатежаНаСервере(Заказ)

	Возврат "Оплата по заказу № " + Заказ.Номер + " от " + Заказ.Дата + ". Плательщик: " + Заказ.Контрагент + ", УИН: " + Строка(Заказ.Контрагент.УникальныйИдентификатор());	

КонецФункции // НазначениеПлатежаНаСервере()
